src/Catalogs/док_РазрешенныеКлиентыПользователей.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<Catalog>
		<Properties>
			<Name>док_РазрешенныеКлиентыПользователей</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИспользоватьОграничение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Клиенты</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Клиент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.док_Клиенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/CommonModules/док_СтандартныеПодсистемыСервер/Ext/Module.bsl
Процедура УстановкаПараметровСеанса() Экспорт
	
	
	Если Пользователи.ЭтоПолноправныйПользователь(,,Ложь) Тогда
		ПараметрыСеанса.док_ИспользоватьОграничениеRLSПоКлиентам = Ложь;
	Иначе
		Если ПолучитьФункциональнуюОпцию("док_ИспользоватьОграничениеRLS_ПоКлиентам") Тогда
			Пользователь = Пользователи.ТекущийПользователь();
			ПараметрыСеанса.док_ИспользоватьОграничениеRLSПоКлиентам = ИспользоватьОграничениеRLS_ПоКлиентам(Пользователь);
			ПараметрыСеанса.док_РазрешенныеКлиенты = Новый ФиксированныйМассив(ПолучитьРазрешенныхКлиентовПользователя(Пользователь)); 
		КонецЕсли;
	КонецЕсли;	
	
КонецПроцедуры

Функция ПолучитьРазрешенныхКлиентовПользователя(Пользователь)
	
	Запрос = Новый запрос("ВЫБРАТЬ
	|	док_РазрешенныеКлиентыПользователейКлиенты.Клиент КАК Клиент
	|ИЗ
	|	Справочник.док_РазрешенныеКлиентыПользователей.Клиенты КАК док_РазрешенныеКлиентыПользователейКлиенты
	|ГДЕ
	|	док_РазрешенныеКлиентыПользователейКлиенты.Ссылка.Пользователь = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь",Пользователь);
	Таб = Запрос.Выполнить().Выгрузить();
	Возврат Таб.ВыгрузитьКолонку("Клиент");
	
КонецФункции	

Функция ИспользоватьОграничениеRLS_ПоКлиентам(Пользователь)
	
	Запрос = Новый запрос("ВЫБРАТЬ
	|	док_РазрешенныеКлиентыПользователей.ИспользоватьОграничение КАК ИспользоватьОграничение
	|ИЗ
	|	Справочник.док_РазрешенныеКлиентыПользователей КАК док_РазрешенныеКлиентыПользователей
	|ГДЕ
	|	док_РазрешенныеКлиентыПользователей.Пользователь = &Пользователь");
	Запрос.УстановитьПараметр("Пользователь",Пользователь);
	ЗВ = Запрос.Выполнить();
	Если ЗВ.Пустой() Тогда
		Возврат Ложь;
	Иначе	
		Таб = ЗВ.Выгрузить();
		Возврат Таб[0].ИспользоватьОграничение;
	КонецЕсли;
	
КонецФункции
